/*
数间三步距

问题描述
在一座安静的图书馆中，一位算法大师与一位诗人邂逅。
他们讨论起了数字的奥秘，算法大师提出了一个关于特别数字的概念：
“一个正整数是特别的，若其没有重复的数字，且每一对数字之间的绝对差是 3 的非零倍数。”
他细声细语地说：
“例如，数字 285 是特别的，因为 2、3、5 各不相同，并且 ∣2−8∣=6，∣8−5∣=∣5−2∣=3，它们都是 3 的倍数。”

诗人着迷于这一概念，回应道：
“在这些数字的舞蹈中，步伐是以三的距离移动，它们互不模仿，各显神通。
那么，在三位数中，有多少是这样的特别数字呢？”
算法大师笑了笑，转过身去，轻轻说：
“这便是我们今日要探寻的谜题。”

于是，诗人拿起羽毛笔，写下了这个问题，希望你能帮忙解答。
请你计算出有多少个三位特别的数字。

输入格式
无。

输出格式
输出一个整数，表示三位数中特别数字的数量。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 30 << endl;

	return 0;
}
