/*
元宵节快乐【算法赛】

问题描述
夜幕降临，明月高悬，元宵之夜的美好氛围洋溢着整个城市。
在这个特殊的夜晚，小鸟儿在树梢歌唱，烟花在空中绽放，人们欢聚一堂，共庆佳节。
而你，我亲爱的朋友，在这元宵之夜，你依然沉浸于算法的海洋，参与着激烈的算法竞赛。
我知道你对于编程的热爱和追求，你的智慧和才华将如明月照亮黑夜，如烟花绽放夜空。

在这个元宵之夜，让我们共同祝愿你，愿你的编程之路充满乐趣和成就。
愿你的代码如琴弦的婉转，优雅而巧妙。愿你的思维如烟花的绚丽，创新而精彩。
加油，我亲爱的朋友！愿你在这个元宵之夜，无论身在何处，都能感受到节日的喜悦和温馨。
愿你的努力和付出得到回报，愿你在算法赛场中展现出非凡的才华。
元宵节快乐！

请你输出 Today AK!，来赢取元宵节的祝福！

输入格式
本题为填空题，无需输入即可作答。

输出格式
输出一个字符串，赢取祝福。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << "Today AK!" << endl;

	return 0;
}
