/*
珠链分三段

问题描述
在一条宁静的村庄，三位编织工坐在一棵大树下，她们手中的珠链共有 10 颗珠子。
她们计划将珠链分成三段，每段都有一定数量的珠子，并且三段珠子的总数正好是 10 颗。
村里的智者走过，看到了她们手中的珠链，便提出了一个问题：
“你们能告诉我，有多少种不同的分法可以将珠链分成三段吗？
并且，如果我们将这些不同的分法视为独特的组合，并计算它们的乘积和，总和会是多少呢？”

一位编织工答道：“智者，我们是需要找到所有正整数 p、q、r 的组合，使得 p+q+r=10 吗？”

智者点了点头，并鼓励他们计算所有这些组合对应的乘积和，即 10!/p!q!r! 的总和。”

现在，请你帮助这三位编织工找出这个总和。

输入格式
无。

输出格式
输出一个整数，表示所有满足条件的正整数组 (p,q,r) 对应的 10!/p!q!r! 的总和。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 55980 << endl;

	return 0;
}
