/*]]]】
2026【算法赛】

问题描述
小蓝即将准备第十七届蓝桥杯省赛，于是找来了第十六届省赛真题琢磨高频考点，发现这类题目中经常会出现打印规律题。
于是，小蓝也设计了一个题目来考考你。

给定一个正整数 n，请按如下规则输出共 n 行：

设一个循环字符串为 2026，对于第 i 行，从这个循环字符串的第一个字符开始，按顺序不断重复取字符，直到一共取出 i 个字符，并将它们按顺序输出。

例如：

第 1 行输出前 1 个字符，即 2
第 2 行输出前 2 个字符，即 20
第 3 行输出前 3 个字符，即 202
第 4 行输出前 4 个字符，即 2026
第 5 行继续循环，输出前 5 个字符，即 20262
现在，请你根据给定的 n 完成输出。

输入格式
输入一行，包含一个正整数 n(1≤n≤100)。

输出格式
输出共 n 行，第 i 行输出按照上述规则得到的长度为 i 的字符串。

样例输入
6

样例输出
2
20
202
2026
20262
202620
*/
#include <iostream>
using namespace std;
int main()
{
    int n, a[4] = { 2,0,2,6 };
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j <= i; j++)
            cout << a[j % 4];
        cout << endl;
    }

    return 0;
}
