/*-[]]
心怡的羊驼

问题描述
心怡同学养了一群羊驼，但有只有一只她特别喜欢，因为希望在向别人介绍时能在羊群中一眼就找到这只羊驼，所以她给每个羊驼身上都写了一个唯一的数字 x。
这样当向人们介绍他最喜欢的羊驼时直接报号码就好。
但羊驼身上的数字可不是乱写的。
数字 x 的个位加十位之和即为心怡同学对这只羊驼的心怡程度，那么最心怡的羊驼身上的数字自然就是个位加十位之和最大的。

现在知道规则的你，能不能在羊群中快速找到这个最心怡的羊驼呢？（题目保证最心怡的羊驼唯一）。

输入格式
第一行输入 n 为羊群的数量 (1≤n≤99)。

第二行有 n 个数，为羊群中羊驼的编号(保证编号在范围内 [1,99])。

输出格式
输出最心怡的羊驼的编号。

样例输入
5
1 14 35 91 88

样例输出
88
*/
#include <iostream>
using namespace std;
int main()
{
    int n, m, x, y = 0;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        cin >> m;
        if (m % 10 + m / 10 > y)
            x = m, y = m % 10 + m / 10;
    }
    cout << x << endl;

    return 0;
}
