/*
古木下沉思

问题描述
在一座被时光遗忘的庭院里，一位数学诗人常坐在古木下沉思。
他眼中的世界充满了数字与自然的和谐，他的诗句里融合了算法与哲思。

有一日，深秋的落叶在他的算卷上铺成了一层金黄，诗人的目光落在了落叶之下一道未完成的题目上。

题目是关于无穷大数的求解，他轻声念道：

“当 5^(1/2) 与 6^(1/2) 如秋风中舞动的叶片，共同升至高度的第 4000 层，它们的和的整数部分被 100 除，会留下何等韵迹？”

这时，一个慕名而来的年轻学者走进了庭院，看到了这位诗人。他被这问题吸引，便询问道：“此题是何意？”

诗人睁开眼，微笑着回答：
“这是一道考验我们对数字本质理解的问题，我们需要找出 ⌊( 5^(1/2) + 6^(1/2) )^4000⌋ 被 100 除后的余数。”

请你帮助这位年轻学者解答诗人的题目，找出 ⌊( 5^(1/2) + 6^(1/2) )^4000⌋ 被 00 除后的余数。

输入格式
无。

输出格式
输出一个整数，表示 ⌊( 5^(1/2) + 6^(1/2) )^4000⌋ 被 100 除后的余数。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 1 << endl;

	return 0;
}