/*
谁做了作业

题目描述
老师给A、B、C、D、E五个学生布置了一次作业。
检查后发现：

(1) A和B要么都做了作业，要么都没做。

(2) B和C只有一个人做了作业。

(3) D没有做作业。

(4) C和E最多有一人做了作业。

请问谁做了作业。

输入描述
本题无输入。

输出描述
输出做了作业的学生名单。
如果有多组解，首先按做了作业的人数从少到多的顺序输出各组解，如果存在人数相同的解，则再按字典序输出每组解，每组解占一行。每组解如果有多个人，用空格隔开。

样例输入
本题无输入。

样例输出
E    (仅仅给出输出样例，不是正确的解)
A C
A E
A C E

知识点
命题的表示
命题的真值
枚举
*/
#include <iostream>
using namespace std;
int main()
{
	cout << "C" << endl;
	cout << "A B" << endl;
	cout << "A B E" << endl;

	return 0;
}