/*
钟表发明]
]]]
问题描述
在古镇的清晨，阳光洒在老钟的铺子前。
钟表匠正在研究他的新发明——一种用数字拼图解谜的钟。
每个时辰，钟面上的数字都会重新排列，形成一个新的谜题。

"老钟，你这谜题真是趣味横生啊。"
顾客张先生赞叹道。

"是啊，这机关中，数字的变换遵循着特定的规律。" 
老钟答道，并指着他的数字钟，上面显示着一串数字。

"看这里，假设 A,B,C,P,Q,R,W,X,Y，和 Z 都是不同的十进制数字，并且满足下面的等式："
	‾AAA + ‾BBB + ‾CCC = ‾PPP + ‾QQQ + ‾RRR = ‾WXYZ

"那么，这串数字—— ‾WXYZ ——又有多少种可能的值呢？"
张先生好奇地问。

老钟微微一笑，拿起笔和纸，开始计算。

请你帮助老钟计算 ‾WXYZ 有多少种可能的值。

输入格式
无。

输出格式
输出一个整数，表示 ‾WXYZ 可能的值的数量。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 0 << endl;

	return 0;
}
