/*
上交文物【算法赛】

问题描述
话说小哥张起灵、吴邪和胖子盗墓归来，小哥惜字如金，只说了三个字：“上交国”。4
胖子一听，顿时急眼了：“啥？上交？那胖爷我下半辈子吃啥喝啥？好歹给胖爷留点养老钱啊！”

吴邪赶紧打圆场：“胖子，小哥的意思是，把文物上交给国家。
咱们这次一共发现了七星鲁王宫的青铜鼎、蛇眉铜鱼、玉俑、鬼玺以及战国帛书，一共五件文物。
按照规定，每件文物可以获得 1000 个金币奖励，所以我们一共能获得 5000 块奖金。
这 5000 块钱咱们三个平分！”

胖子一听，乐了：“哎！这还差不多！那胖爷我就勉为其难，同意吧！”

现在，请你计算一下，每人可以分到多少钱？

如果无法均匀分配（即结果不是整数），请将结果向下取整，即算出每人可以分到的整数金额。

输入格式
无

输出格式
输出一个整数，表示每人可以分到的钱数。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 5000 / 3 << endl;

	return 0;

}
