/*
小蓝的鸡蛋

问题描述
小蓝的农场里面有一个很大的养鸡场，养鸡场里面一共有 n 只母鸡，编号分别为 1∼n。
开始时，所有母鸡的鸡窝里面分别有 a1 ,a2 ,...,an 个鸡蛋，现在已知在某一时刻，第 i 只母鸡会下 bi 个鸡蛋，然后小蓝想要知道当前母鸡编号为 [l,r] 区间内的鸡窝里一共有多少个鸡蛋，因为小蓝数学不好，因此请你来帮助帮助他。

输入格式
输入第 1 行包含一个正整数 n(n∈[1,2×10^5 ])，表示母鸡的数量。

输入第 2 行包含 n 个正整数 ai(ai ∈[1,10^6 ])，表示开始时每个鸡窝的鸡蛋数量。

输入第 3 行包含一个正整数 q(q∈[1,2×10^5 ])，表示计算区间鸡蛋总数的次数。

接下来 q 行，每行包含三个正整数：

1 i x：编号为 i 只母鸡当前时刻又下了 x 个鸡蛋；
2 l r：给定 l,r，计算当前时刻编号区间为 [l,r] 内的母鸡鸡窝里面一共有多少个鸡蛋。
其中，1≤l≤r≤n，i∈[1,n]，x∈[1,10^6 ]。

注意：题目测试数据保证至少有一次操作 2！

输出格式
对于每个 2 l r 操作输出一行，每行包含一个整数，表示所求的结果。

样例输入
5
1 1 1 1 1
3
1 2 2
2 1 2
2 3 3

样例输出
4
1
*/
#include <iostream>
using namespace std;
int main()
{

	return 0;
}