/*】】】】
数值判断

问题描述
给定一个正整数 n ，请判断 n 的所有数位上的值是否从左到右是严格递增的。

例如 : 1589 是严格递增的。

再如: 1336 不是严格递增的，中间有相同的 3 。

再如 : 1598 不是严格递增的。

输入格式
输入一行包含一个整数 n 。

输出格式
如果是严格递增的，输出 "YES" (全大写)，否则输出 “NO" (全大写)。

样例输入
1589

样例输出
YES

样例输入
1336

样例输出
NO

评测用例规模与约定
对于所有评测用例，1<=n<=1000000000 。
*/
#include <iostream>
using namespace std;
int main()
{
    int n, m = 10;
    bool b = 1;
    cin >> n;
    do {
        b = n % 10 < m;
        m = n % 10, n /= 10;
    } while (b && n);
    cout << (b ? "YES" : "NO") << endl;

    return 0;
}
