/*
求“(P∨Q)∧(P→R)∧(Q→R)”成真赋值

题目描述
编程求命题合式公式(P∨Q)∧(P→R)∧(Q→R)取值为T时的赋值（即P、Q、R的值）。
禁止采用手工演算列出真值表，再用输出语句输出答案。

输入描述
无输入。

输出描述
按字典序输出该合式公式取值为T时的所有赋值（即P、Q、R的值，1或0，用空格隔开），每种赋值占一行。

样例输入
无输入。

样例输出
0 1 1      (仅给出第1行输出作为示例)
*/
#include <iostream>
using namespace std;
int main()
{
	int i, j, k;
	for (i = 0; i < 2; i++)
		for (j = 0; j < 2; j++)
			for (k = 0; k < 2; k++)
				if ((i || j) && !(i && !k) && !(j && !k))
					cout << i << " " << j << " " << k << endl;

	return 0;
}