/*
哪来的AC【算法赛】

问题描述
小明参加了蓝桥杯比赛，赛场上，他紧张得手心冒汗，不停地搓手。

突然，他灵光一闪，想到了一个绝妙的算法！他激动地敲击键盘，代码行云流水般地涌现。

提交！AC！

他兴奋地大喊：“AC？是 AC！我终于 AC 了，终于通过了！”。话音刚落，就引来周围选手疑惑的目光。

这时，监考老师走了过来，拍了拍他的肩膀，语重心长地说：“小伙子，蓝桥杯是 OI 赛制的比赛，哪来的 AC 啊？”

“对哦，那我这 AC 哪来的”。说完，小蓝看向了自己的电脑。原来啊，小蓝用手机开了个热点，偷偷给电脑连了网。这不，他竟不小心把代码提交到了第三方平台。

“蓝桥杯比赛过程中不允许连网、更不允许访问第三方平台！为了让你记住这次教训，请你数一下蓝桥杯这三个字的笔画数。你若是答对了，我就给你个弥补错误的机会；但若是答错了，嘿嘿…”

小蓝的脸瞬间涨得通红，他意识到自己犯了多么严重的错误。周围选手窃窃私语的声音更大了，监考老师的眼神也变得严肃起来。他后悔莫及，刚才的兴奋劲儿早已荡然无存，取而代之的是深深的恐惧和懊悔。他甚至不敢去看监考老师，生怕听到那句“嘿嘿…”后面隐藏的严厉处罚。

只见默默地低下头，手指紧紧地攥着鼠标，大脑一片空白，完全不知道该怎么办。

作为小蓝的铁哥们，请你帮助小蓝，算算蓝桥杯 这三个字共有多少笔画吧。

输入格式
无。

输出格式
一个整数，表示答案。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 31 << endl;

	return 0;
}