/*
中位数【省模拟赛】

问题描述

以下有 9 行 9 列共 81 个整数，请问这些数的中位数是多少？

567 134 500 369 524 778 658 962 264

405 345 881 727 161 591 395 342 427

136 991 304 402 253 392 782 421 816

918 195 147 226 471 838 169 212 567

299 935 994 903 511 822 733 673 264

841 611 453 668 447 744 362 457 337

359 723 841 629 878 716 435 690 142

388 506 140 942 464 248 546 505 690

529 170 150 706 601 193 948 829 123

答案提交
这是一道结果填空的题，你只需要算出结果后提交即可。
本题的结果为一个整数，在提交答案时只填写这个整数，填写多余的内容将无法得分。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 505 << endl;

	return 0;
}
