/*】】】
纸张尺寸

问题描述
在 ISO 国际标准中定义了 A0 纸张的大小为 1189mm × 841mm, 将 A0 纸 沿长边对折后为 A1 纸, 大小为 841mm × 594mm, 在对折的过程中长度直接取 下整 (实际裁剪时可能有损耗)。
将 A1 纸沿长边对折后为 A2 纸, 依此类推。

输入纸张的名称, 请输出纸张的大小。

输入格式
输入一行包含一个字符串表示纸张的名称, 该名称一定是 A0、A1、A2、 A3、A4、A5、A6、A7、A8、A9 之一。

输出格式
输出两行，每行包含一个整数，依次表示长边和短边的长度。

样例输入1
A0

样例输出1
1189
841

样例输入 2
A1

样例输出 2
841
594
*/
#include <iostream>
using namespace std;
int main()
{
    int n, w = 1189, h = 841, t;
    char c;
    cin >> c >> n;
    for (int i = 0; i < n; i++)
        t = h, h = w / 2, w = t;
    cout << w << '\n' << h << endl;

    return 0;
}
