/*
谓词实例4(三元谓词)

题目描述
已知客体域A={2, 3, 9, 12, 15, 17, 22, 23, 27, 29}，谓词P(x, y, z)表示“x和y互质且y能整除z (x, y, z互不相同)”。
求使得该谓词取值为T的x, y, z取值。

输入描述
本题无输入。

输出描述
输出使得谓词P(x, y, z)取值为T的x, y, z取值，用空格隔开。
如果有多个取值组合符合要求，则每个取值组合占一行，且首先输出x取值最小的组合，对x取值相同的组合，则先输出y取值最小的组合，以此类推。
注意，在本题中，诸如“2 3 12”和“3 2 12”，应视为不同的取值组合，因为这两个组合中y的值是不一样的。
*/
#include <iostream>
using namespace std;
int main()
{
    int a[] = { 2, 3, 9, 12, 15, 17, 22, 23, 27, 29 }, n = 10, x, y, z;
    for (int i = 0; i < n; i++)
        for (int j = 0; j < n; j++)
            if (i != j)
            {
                z = a[i], x = a[j];
                while (1)
                {
                    y = x;
                    x = z;
                    z = y % x;
                    if (!z)break;
                }
                if (x == 1)
                    for (int k = 0; k < n; k++)
                        if (a[k] % a[j] == 0 && k != i && k != j)
                            cout << a[i] << " " << a[j] << " " << a[k] << endl;
            }

    return 0;
}
