/*
喜忧参半

题目描述
有A、B、C、D四个学生被分到了同一个寝室。
寝室有四张床，布局如下图所示，1号和2号床位在同一边，1号和4号离得远，2号和3号也离得远。
四个学生都有各自的期望。

A：我希望分到靠近过道的床位，和B离得远一点（B睡觉要打呼噜，A睡眠不好）。

B：我希望分到靠近过道的床位，和D在同一边。

C：我希望分到靠近窗户的床位，但不要靠近卫生间。（2号床位靠近卫生间）

D：我希望分到靠近窗户的床位，和A在同一边。

床位分配方案出来后，四个学生都是喜忧参半，即愿望都只实现了一半。

你能推算出分配方案吗？
请输出A、B、C、D的床位号，用空格隔开。

输入描述
本题无输入。

输出描述
输出符合题意的分配方案，即A、B、C、D的床位号，用空格隔开。
如果有多组解，则每组解占一行，且按字典序输出每组解，即先按A的床位号从小到大的顺序排列，再按B的床位号从小到大的顺序排列，以此类推。

样例输入
本题无输入。

样例输出
1 2 3 4            (仅仅给出输出样例，不是正确的解)
1 3 2 4
*/
#include <iostream>
using namespace std;
int main()
{

	return 0;
}