/*
春水景象

问题描述
在一个遥远的国度，人们用数字编织故事，用方程揭示自然的奥秘。
在春天的某一日，智者与弟子围坐在桃花盛开之地，智者提出了一个关于春天的谜题：“在大自然的法则中，存在一个正的实数 a，它和春水初生的清澈，春林初盛的生机一样，纯净而神秘。
这个数满足着一个和谐的比例，即 4a^2+1/a^2=4，它如同春水与岸边树木的对话，互相映衬，互相平衡。”

弟子们听得入神，智者微笑着又说：“在大自然的语言中，这个数 a 能构建一个更宏伟的景象，就像春水涌动时汇聚的波澜，那就是 M=(8a^3+1/a^3)^2 ，这个景象的宏伟程度可以用一个整数来衡量。”

“智者，请问我们如何才能揭晓这个整数是多少？”一位弟子问道。

智者回应道：“你们将心中的静谧与自然的法则相结合，解开那个平衡的方程，就能找到答案。”

请你揭晓这个整数 M 的值。

输入格式
无。

输出格式
输出一个整数，表示整数 M 的值。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 32 << endl;

	return 0;
}