/*
奇怪的分式

题目描述
本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。

上小学的时候，小明经常自己发明新算法。
一次，老师出的题目是：4/1 乘以 5/8 小明居然把分子拼接在一起，分母拼接在一起，答案是：18/45 （参见下图）

https://doc.shiyanlou.com/courses/uid1580206-20210319-1616147105200

老师刚想批评他，转念一想，这个答案凑巧也对啊，真是见鬼！

对于分子、分母都是 1~9 中的一位数的情况，还有哪些算式可以这样计算呢？

请写出所有不同算式的个数（包括题中举例的）。

显然，交换分子分母后，例如： 4/1 乘以 5/8 是满足要求的，这算做不同的算式。

但对于分子分母相同的情况，2/2 乘以 3/3 这样的类型太多了，不在计数之列!
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 14 << endl;

	return 0;
}