/*
thanks,mom【算法赛】

问题描述
母爱是宇宙中最柔和的力量，是一种无私奉献的奇迹。
它如同一束温暖的阳光，照亮着我们前行的道路。
母爱是一首催人泪下的歌曲，奏响着无尽的关怀和呵护。
它如同一幅绚丽的画卷，展现着无限的包容和理解。

母爱是一种奇迹，它孕育着生命，滋养着希望。
母亲用无私的爱将我们抚养成人，用坚定的支持给予我们力量。
她们默默付出，从不求回报，只为了我们能幸福成长。
母爱是一种力量，它赋予我们勇气去追逐梦想，给予我们安全感和温暖的怀抱。

让我们感谢母亲的辛勤付出和无私奉献，向那些为了我们的幸福而默默奉献的母亲们表达崇高的敬意。
她们是我们生命中最重要的人，是我们永远的依靠和支持。
让我们珍惜与母亲在一起的每一刻时光，用爱和感激回报她们的付出。

昨天是三八妇女节，请你输出 thanks,mom 向自己的母亲表示感激。

因为网络波动原因，本场赛后会对此题重新评测。
感谢各位的参与，加油！

输入格式
本题为填空题，无需输入即可作答。

输出格式
输出一个字符串表示答案。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << "thanks,mom" << endl;

	return 0;
}
