/*
数寻一一一零

问题描述
在一次盛大的庆典上，数学家被赋予了一个难题：在无尽的数字序列中找到特定的图案。
具体来说，是在十进制表示的 8 位整数中寻找包含连续的「1110」这一排列的数。如同寻找天上的流星一般，这些数字稀缺而珍贵。
数学家对围观的市民说：“在这茫茫数字海中，「1110」的身影隐匿其中，你们猜测有多少个 8 位数能捕捉到这一连珠之美？”

市民们议论纷纷，而最好奇的小孩提问道：“数学家先生，请告诉我们答案好吗？”

数学家微笑着回答：“让我们一起解开这个由数字编织的谜题。”接着，他就把头扭向了你。

请你帮助数学家计算出在 10^7 以上且小于 10^8 的整数中，包含「1110」这样一个连续 4 位数的整数共有多少个，并向这群充满好奇心的市民揭晓答案。

输入格式
无。

输出格式
输出一个整数，表示在 10^7 以上且小于 10^8 的整数中，包含「1110」连续 4 位的整数的个数。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 45999 << endl;

	return 0;
}