/*
数序如流水，终逢满船清梦

问题描述
在一个遥远的村庄，智者阿墨每日都会沿着溪流漫步，寻找着自然与数学间的和谐。
一天，他在溪边的石板上发现了一串数字：
123456789，似乎是一个序列的起始。
阿墨驻足凝思，他知道这个序列藏着一个规律：
每一个数字都是前一个数字的 3/8 加上 14。
溪水潺潺，阿墨低语：“每个数字，如同溪中的涟漪，一环扣着一环，生生不息。”

村中的孩童小慧好奇地凑了过来，她问：“阿墨，这串数字到底蕴含着什么秘密呢？”

阿墨微笑着回答：“小慧，这是一个序列，每一个数字都与前一个有着不解之缘。
就像我们的人生，每一步都踏在了前一步的基础上。”

小慧想了想，又问：“那么，如果我们按照这个规律走下去，第 2022 步会在哪里呢？”

“这个问题很有意思。” 阿墨说，他拾起一枝树枝，在地上写下了序列的规律，并开始计算。

请你帮助小慧与阿墨一起，找出这个序列的第 2022 个数字，并将它乘以 10，取最接近的整数告诉他们。

输入格式
无。

输出格式
输出一个整数，表示序列的第 2022 个数字乘以 10 的值。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 224 << endl;

	return 0;
}
