/*
 四人言而有一信

问题描述
在古代的一个小村落，有一个传统的年度庆典，村民们会聚集一起解决一个年度之谜。
今年的谜题是由四位智者 A,B,C,D 提出的关于一个神圣数字 x 的谜题。
智者们各自提出一个线索，但村民们知道，只有一位智者说的是真话，其他三位不是在说谎，就是被误导了。

智者的线索如下：

智者 A: 数字 x 是 7 的倍数。
智者 B: 数字 x 不是 16 的倍数。
智者 C: 数字 x 在 100 以上且在 200 以下。
智者 D: 智者 A 和 B 的线索，只有一个是真的。
村民们现在需要找出这个神圣数字 x 的最小可能值。

请你帮助村民们计算出这个值。

输入格式
无。

输出格式
输出一个整数，表示神圣数字 x 的最小可能值。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 128 << endl;

	return 0;

}




