/*
六处同光映，零处何影生

问题描述
在古镇的钟楼上，钟摆的影子随着时间的流逝在地面上勾勒出不同的图案。
一个老钟表匠观察到，无论昼夜如何变换，钟摆的影子长度总在六个特定的时刻相同。
他将这些时刻对应的长度记为一个数值 12。
钟表匠对这个现象产生了浓厚的兴趣，他决定构造一个模型来模拟这种情况。
在他的模型中，钟摆的影子长度由一个三次多项式 f(x) 描述，且满足 ∣f(1)∣=∣f(2)∣=∣f(3)∣=∣f(5)∣=∣f(6)∣=∣f(7)∣=12。
现在，他想知道，在时间的起点，也就是 x=0 时，这个模型预测的钟摆影子长度是多少。

请你计算出 ∣f(0)∣ 的值。

输入格式
无。

输出格式
输出一个整数，表示在时间的起点钟摆影子长度的绝对值。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 72 << endl;

	return 0;

}



