/*
随意组合

题目描述
本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。

小明被绑架到 X 星球的巫师W那里。

其时，W 正在玩弄两组数据 (2358) 和 (1467)。 
他命令小明从一组数据中分别取数与另一组中的数配对，共配成 4 对（组中的每个数必被用到）。

小明的配法是：(8,7),(5,6),(3,4),(2,1)

巫师凝视片刻，突然说这个配法太棒了！

因为每个配对中的数字组成两位数，求平方和，无论正倒，居然相等：

87^2+56^2+34^2+21^2=12302

78^2+65^2+43^2+12^2=12302

小明想了想说：“这有什么奇怪呢，我们地球人都知道，随便配配也可以啊！”
(8,6),(5,4),(3,1),(2,7)

86^2+54^2+31^2+27^2=12002

68^2+45^2+13^2+72^2=12002 

巫师顿时凌乱了。。。。。

请你计算一下，包括上边给出的两种配法，巫师的两组数据一共有多少种配对方案具有该特征。

配对方案计数时，不考虑配对的出现次序。
就是说：(8,7),(5,6),(3,4),(2,1) 与 (5,6),(8,7),(3,4),(2,1) 是同一种方案。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 24 << endl;

	return 0;
}
