/*
土地测量

题目描述
本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。
https://doc.shiyanlou.com/courses/uid1580206-20210325-1616641433861

造成高房价的原因有许多，比如土地出让价格。既然地价高，土地的面积必须仔细计算。遗憾的是，有些地块的形状不规则，比如是如下图中所示的五边形。
https://doc.shiyanlou.com/courses/uid1580206-20210325-1616641455663

图片描述

一般需要把它划分为多个三角形来计算。

已知三边求三角形的面积需要用海伦定理，参见下图：

图片描述

各条边长数据如下：

    AB = 52.1
    BC = 57.2
    CD = 43.5
    DE = 51.9
    EA = 33.4
    EB = 68.2
    EC = 71.9

根据这些数据求五边形地块的面积。四舍五入到小数后两位。
*/
#include <iostream>
using namespace std;
int main()
{
    cout << "3789.86" << endl;

    return 0;
}
