/*
礼物打包【算法赛】

问题描述
小蓝顶着驯鹿角，蹲在零下 38℃ 的仓库门口，手里攥着一张烫金的《圣诞礼物打包任务单》，整个人都在怀疑人生。

圣诞老人后勤部长笑眯眯地递过来一张表格：

" 7 天打包期，每天都要给全世界的小朋友准备礼物袋子，每完成一个袋子你都能获得 1 点快乐值 "

表格上写着：

天数	   当天打包的礼物袋子数量
第 1 天           1 个
第 2 天           2 个
第 3 天           4 个
第 4 天           8 个
第 5 天           16 个
第 6 天           32 个
第 7 天           64 个
部长得意地说："我们采用了经典的 '指数爆炸式激励！"

宣传口号都想好了—— "从 1 开始，7 天后直接原地成圣诞首富! "

小蓝瑟瑟发抖："您确定我手不会先冻掉？"

现在，请你帮小蓝计算这 7 天小蓝一共获得了多少快乐值？

输入格式
无。

输出格式
输出一个整数，表示答案。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 127 << endl;

	return 0;

}




