/*
新年快乐【算法赛】

问题描述
亲爱的选手们，

2023 即将结束，在这一刻，我想问你们：
是否还记得那些深夜解题的时光？
当寂静的夜晚只有键盘的敲击声和心中的思绪争鸣时，你们一次又一次地翻开别人的代码，寻找解决难题的答案。
那份坚持，那份执着，已经成为了你们不可或缺的一部分。

是否还记得每一场比赛的紧张时刻？
当比赛的钟声响起，你们如同战士一般坐在电脑前，用智慧和勇气与时间赛跑。
每一个 AC（Accept）的提示音都是对你们努力的肯定，每一个 WA（Wrong Answer）都激励你们不断前进。

而那些 AK 的瞬间，那份喜悦和成就感是多么难以忘怀！
它们不仅是分数的累积，更是你们无数个日夜努力的见证。
每一个成功的提交都是你们智慧的火花，在竞赛的历程中熠熠生辉。

现在，站在新的起跑线上，可能会有疲倦，可能会有疑惑，但请不要忘记那些夜晚的坚持和比赛的激情。
让它们成为你们前进的动力，让这一路上的艰辛和荣耀共同铸造你们的未来。

愿你们在即将到来的 2024 年再次感受到 AK 的喜悦，愿那份喜悦伴随着你们每一次的尝试和努力。
不论前路如何，你们都已经是赢家。

所以，请为自己加油吧，输出 2024 AK 即可通过本题。

输入格式
本题无输入。

输出格式
根据题意输出一行表示答案。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << "2024 AK" << endl;

	return 0;

}



