/*
一步之遥

题目描述
本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。

一步之遥

从昏迷中醒来，小明发现自己被关在 X 星球的废矿车里。 
矿车停在平直的废弃的轨道上。 
他的面前是两个按钮，分别写着 “F” 和 “B” 。

小明突然记起来，这两个按钮可以控制矿车在轨道上前进和后退。 
按 F，会前进 97 米。
按 B 会后退 127 米。 
透过昏暗的灯光，小明看到自己前方 1 米远正好有个监控探头。 
他必须设法使得矿车正好停在摄像头的下方，才有机会争取同伴的援助。 
或许，通过多次操作 F 和 B 可以办到。

矿车上的动力已经不太足，黄色的警示灯在默默闪烁... 每次进行 F 或 B 操作都会消耗一定的能量。 
小明飞快地计算，至少要多少次操作，才能把矿车准确地停在前方 1 米远的地方。

请问为了达成目标，最少需要操作的次数是多少。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 97 << endl;

	return 0;
}
