/*
零食争议【算法赛】

问题描述
暑假旅行前夕，小蓝和小桥因为带多少零食而爆发了“世界大战”。

小蓝是个“仓鼠精”，他张开双臂，激动地比划着：
“我们这次出去玩整整一周，也就是 7 天，必须得有充足的储备！万一迷路了呢？万一商店关门了呢？万一外星人入侵地球了呢？我认为，每天至少得带够三顿饭的零食！”

小桥则是个“极简主义者”，她翻了个大大的白眼：
“我们是去旅游，不是去逃难！你这是想把整个超市搬过去吗？每天带一包救急的就够了！”

两人争执不下，眼看旅行就要泡汤。这时，他们的朋友“和事佬”小浩听得头都大了，终于忍不住站了出来，清了清嗓子说：
“停，都别吵了，我来给你们定规矩吧！你们的旅行一共 7 天，对吧？这样，你们在旅行的第奇数天，带上与‘天数’相同数量的零食；至于偶数天嘛……就别带了，好好享受当地美食不行吗？”

小蓝和小桥想了想，觉得这个规矩听起来很酷，于是立刻握手言和，愉快地开始分行李。

现在，请你根据“和事佬”小智的“天才”规则，计算一下，他们俩要带多少件零食去旅行？

输入格式
无。

输出格式
输出一个整数，表示他们可以带的零食总数。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 1 + 3 + 5 + 7 << endl;

	return 0;
}
