/*
数序交响定年礼

问题描述
在新年的钟声渐行渐远之际，TT 同学与 YY 老师坐在暖炉旁，举行一场数序的盛宴。
YY 老师笑着说：“TT，今年的年礼，我们来玩一个游戏决定吧。”

游戏的规则是这样的：TT 同学和 YY 老师各自独立选择 1 到 24 的一个全排列，即：
	(a1,a2,…,a24),(b1,b2,…,b24)

每个人心中揣着自己的序列，仿佛握着一副宿命的牌。
他们将各自的选择同时展示出来，TT 同学将得到如下计算所得的金额作为年礼：
	a1b1 + a2b2 + ⋯ + a24b24

在漫天飞雪的夜晚，两人都随机地从 24! 种排列中挑选一种，TT 同学心中思量：“我今年会收到多少年礼呢？”请你帮助 TT 同学计算他所得年礼的期望值。

输入格式
无。

输出格式
输出一个整数，表示 TT 同学所得年礼的期望值。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 3750 << endl;

	return 0;

}




