/*
数字链交响

问题描述
在一个平和的村庄，村民们喜欢用数字来编织谜语。一位智者提出了一个由数字组成的链式之谜，村中的年轻人汇聚一堂，试图解开这个谜题。

智者说：“观察这些数字，它们是有序排列的，按照我的规则，你们能找出这个序列的秘密吗？”

他展示的是一个数字序列，每个数字都是由三个数字重新排列组合而成。
年轻人们发现，序列中的数字看似随机，却隐藏着复杂的联系。

智者继续解释：“将这些数字组合，你们将见证数学之美。请你们计算如下表达式的值：”

(987+879+798)×(876+768+687)×(765+657+576)×(654+546+465)   /   (543+435+354)×(432+324+243)×(321+213+132)×(210+102+21)

请你帮助村中的年轻人解开这个数字之谜，并计算出表达式的值。

输入格式
无。

输出格式
输出一个整数，表示该表达式的值。

说明
本题为填空题，只需要算出结果后，在代码中使用输出语句将结果输出即可。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 70 << endl;

	return 0;

}
