/*
摆花

题目描述
小明的花店新开张，为了吸引顾客，他想在花店的门口摆上一排花，共 m 盆。
通过调查顾客的喜好，小明列出了顾客最喜欢的 n 种花，从 1 到 n 标号。
为了在门口展出更多种花，规定第 i 种花不能超过 ai 盆，摆花时同一种花放在一起，且不同种类的花需按标号的从小到大的顺序依次摆列。

试编程计算，一共有多少种不同的摆花方案。

输入描述
第一行包含两个正整数 n 和 m，中间用一个空格隔开。

第二行有 n 个整数，每两个整数之间用一个空格隔开，依次表示 a1 、a2 、......an 。

其中，0<n≤100，0<m≤100，0≤ai≤100。

输出描述
输出只有一行，一个整数，表示有多少种方案。注意：因为方案数可能很多，请输出方案数对 10^6+7 取模的结果。

输入输出样例
示例

输入
2 4
3 2

输出
2
*/
#include <iostream>
using namespace std;
int main()
{
	// 请在此输入您的代码
	return 0;
}
