/*
身份证号校验

题目描述
本题为代码补全填空题，请将题目中给出的源代码补全，并复制到右侧代码框中，选择对应的编译语言（C/Java）后进行提交。
若题目中给出的源代码语言不唯一，则只需选择其一进行补全提交即可。
复制后需将源代码中填空部分的下划线删掉，填上你的答案。
提交后若未能通过，除考虑填空部分出错外，还需注意是否因在复制后有改动非填空部分产生错误。

如果让你设计个程序，用什么变量保存身份证号码呢？长整数可以吗？不可以！

因为有人的身份证最后一位是 "X"。

实际上，除了最后一位的 X，不会出现其它字母！

身份证号码 18 位 = 17 位 + 校验码

校验码的计算过程：

例如：身份证前 17 位 = ABCDEFGHIJKLMNOPQ

A~Q 每位数字乘以权值求和（每位数字和它对应的“权”相乘后累加）。

17 位对应的权值分别是：

7 9 10 5 8 4 2 1 6 3 7 9 10 5 8 4 2

求出的总和再对 11 求模

然后按下表映射：

余数: 0 1 2 3 4 5 6 7 8 9 10

校验码： 1 0 X 9 8 7 6 5 4 3 2

下面的代码实现了校验过程，输入串为身份证前17位，打印出校验码。

请仔细阅读代码，并填写划线部分缺失的代码。

源代码
C


#include <stdio.h>
#include <stdlib.h>
char verifyCode(char* s)
{
    static int weight[] = {7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};
    static char map[] = {'1','0','X','9','8','7','6','5','4','3','2'};

    int sum = 0;
    for(int i=0; i<17; i++)
    {
        sum += (______________) * weight[i];  // 填空
    }

    return map[______________];  // 填空

}

int main(int argc, char* argv[])
{
    printf("%c\n", verifyCode("32011119610215381"));
    printf("%c\n", verifyCode("42900819801018236"));
    return 0;
}
*/

#include <stdio.h>
#include <stdlib.h>
char verifyCode(char* s)
{
    static int weight[] = { 7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2 };
    static char map[] = { '1','0','X','9','8','7','6','5','4','3','2' };

    int sum = 0;
    for (int i = 0; i < 17; i++)
    {
        sum += (s[i] - '0') * weight[i];  // 填空
    }

    return map[sum % 11];  // 填空

}

int main(int argc, char* argv[])
{
    printf("%c\n", verifyCode("32011119610215381"));
    printf("%c\n", verifyCode("42900819801018236"));
    return 0;

}



