/*
冬季旅游团【算法赛】

问题描述
“师傅，要不咱别去了吧，这都冻成包子馅了。”

小蓝拎着背包，脚踩在嘎吱作响的雪地上，望着眼前那块写着“冬季旅行体验点——极地特价村”的招牌，满脑子问号。

导游胳膊插在口袋里，一脸理智地说：“别怂，这可是全年最低价的冬游，一趟下来管吃管住，还送免费冰壶体验！”

小蓝打了个喷嚏，“咋感觉这‘免费体验’听着不太吉利？”

导游咳了一声，掏出一张【旅行积分表】，上面清清楚楚地写着：

全程共 7 天，每天只有两种状态：
冻但可忍：记 1 分快乐值。
冻到咒人：记 −1 分快乐值。
“公司宣传语是“苦中作乐”，于是系统自动在 7 天中，安排前 3 天‘冻到咒人’，后 4 天‘冻但可忍’，说什么“这样游客最后能记住我们的‘回暖式服务’”。

“放心，别人都乐着回来，最后的快乐值肯定是正数。”

现在，你需要帮小蓝计算，按照这 7 天的安排，最后的总快乐值是多少。

输入格式
无。

输出格式
输出一个整数，表示小蓝在这 7 天冬季旅行中的总快乐值。
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 1 << endl;

	return 0;
}
