/*
武功秘籍

题目描述
本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。

小明到 X 山洞探险，捡到一本有破损的武功秘籍（ 2000 多页！当然是伪造的）。
他注意到：书的第 10 页和第 11 页在同一张纸上，但第 11 页和第 12 页不在同一张纸上。

小明只想练习该书的第 81 页到第 92 页的武功，又不想带着整本书。请问他至少要撕下多少张纸带走？武功秘籍

题目描述
本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。

小明到 X 山洞探险，捡到一本有破损的武功秘籍（ 2000 多页！当然是伪造的）。
他注意到：书的第 10 页和第 11 页在同一张纸上，但第 11 页和第 12 页不在同一张纸上。

小明只想练习该书的第 81 页到第 92 页的武功，又不想带着整本书。
请问他至少要撕下多少张纸带走？
*/
#include <iostream>
using namespace std;
int main()
{
	cout << 7 << endl;

	return 0;

}





